books = {
    'Автор': {
        'Тарас Шевченко': {
            'Біографія': {
                'Дата Народження': '9 березня 1814 р.',
                'Опис': """Тарас Шевченко - безумовно найвидатніша особистість в історії української культури. Поет народився 9 березня 1814 року в селі Моринці Київської губернії в сім'ї кріпака. Діди і прадіди Тараса були козаками і брали активну участь у визвольних війнах. Особливий вплив на майбутнього автора Кобзаря надав дід Іван. Свого часу він брав участь у Коліївщину і розповів онукові багато подробиць цього повстання.
Уже в 15 років Шевченко прислужував своєму панові Енгельгардту. Під час подорожі у Вільні, пан помітив надзвичайні здібності Тараса в живописі і віддав його на навчання. Уроки художнім мистецтвам продовжилися в Петербурзі, де Шевченко познайомився з Венециановим, Брюлловим і поетом Жуковським. Однак Тарас був кріпаком, його життя повністю належала панові. Юнака легко можна було продати або програти в карти. Саме нові знайомі Шевченка допомогли викупити його з неволі. Після цієї визначної події поет почав навчання в Академії мистецтв. Автор Кобзаря був чудесним портретистом. Він також проявляв здібності як графік та ілюстратор.
Дуже часто ми бачимо в Тараса Шевченка образ народного поета. Однак молодість цієї людини пройшла в світських салонах і з думками про образотворче мистецтво. Шевченко не мислив себе геніальним поетом і не очікував похвальних рецензій. Проте саме завдяки поетичному творчості він став найвідомішою людиною в історії України та символом нації.
У 1843 році Шевченко виїхав з Петербурга в Україну. Він побував у Києві, Чернігові, Полтаві та познайомився з багатьма видатними діячами української культури і прочитав безліч книг своїх співвітчизників. Незабаром він приєднується до Кирило-Мефодіївського товариства. Саме за участь в цій організації і сатиричну поему “Сон” Шевченко був заарештований. Вірші поета завжди отримували самі живі відгуки. Не дивно, що карикатурний образ імператриці був сприйнятий так гостро.
Після цих подій Шевченко провів дуже багато часу в таборах. Часто йому не дозволяли записувати вірші і малювати картини. Сьогодні творчість Шевченка відомо нам завдяки книзі його віршів Кобзар а також картинам. У нашому інтернет магазині ви можете замовити доставку книг Шевченка."""
            },
            'Книги': {
                'Кобзар': {
                    'Видання': {
                        'Паперове': {
                            'Ціна': 370,
                            'Наявність': 281
                        },
                        'Електронне': {
                            'Ціна': 150,
                            'Наявність': 999
                        }
                    }
                },
                'Наймичка': {
                    'Видання': {
                        'Паперове': {
                            'Ціна': 280,
                            'Наявність': 46
                        },
                        'Електронне': {
                            'Ціна': 150,
                            'Наявність': 999
                        }
                    }
                }
            }
        }
    }
}

print('Книгарня)')
print('Доброго дня, в наявності є книги автора(ів)',books['Автор'].keys())

run = True
while run:
    answer = input('1 - Біографія, 2 - Книги')
    if answer == '1':
        print('Дата народження:', books['Автор']['Тарас Шевченко']['Біографія']['Дата Народження'])
        print('Про автора:', books['Автор']['Тарас Шевченко']['Біографія']['Опис'])
    elif answer == '2':
        while True:
            print('В наявності є такі книги:',books['Автор']['Тарас Шевченко']['Книги'].keys())
            book = input('Яку бажаєте ?')
            if book in books['Автор']['Тарас Шевченко']['Книги']:
                print('Чудовий вибір)')
                print('В наявності є:', books['Автор']['Тарас Шевченко']['Книги'][book]['Видання'].keys())
                type = input('Яку бажаєте ?')
                if type in books['Автор']['Тарас Шевченко']['Книги'][book]['Видання']:
                    print('Ціна:', books['Автор']['Тарас Шевченко']['Книги'][book]['Видання'][type]['Ціна'])
                    buy = input('Купляєте ?')
                    if buy == 'Так':
                        print('Гарного дня!')
                        run = False
                        break
                    else:
                        print('Завершити програму - 1, продовжити - 2')
                        answer = input()
                        if answer == '1':
                            run = False
                            break
                        elif answer == '2':
                            break
            else:
                print('Упс помилка(')
                continue
